Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportedModelIsEmpty
Imported model is empty.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportScaleTooLarge
This scale factor would make the imported object too large.  Reverting to the previous scale factor.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCPartialSchemaSupport
IFC versions 4 and above are only partially supported by Open IFC.  Consider using Link IFC instead.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ElementRenamedOnImport
There were duplicate names between the active model and the imported element. To avoid duplicate names, the imported element has been renamed.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFNonUniformScalingTransform
The imported geometry contains non-uniform scaling transformations which Revit does not support.  Some objects may be displaced or distorted.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricData
The original model contains unsupported geometric data such as curves or points.